polesskiy-dev/iot-risk-data-logger-nfc-samd21/firmware/src/packs/ATSAMD21E18A_DFP/component/sysctrl.h
#define SYSCTRL_XOSC32K_ENABLE_Pos            _UINT16_(1)                                          /* (SYSCTRL_XOSC32K) Oscillator Enable Position */
#define SYSCTRL_XOSC32K_ENABLE_Msk            (_UINT16_(0x1) << SYSCTRL_XOSC32K_ENABLE_Pos)        /* (SYSCTRL_XOSC32K) Oscillator Enable Mask */
#define SYSCTRL_XOSC32K_ENABLE(value)         (SYSCTRL_XOSC32K_ENABLE_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_XTALEN_Pos            _UINT16_(2)                                          /* (SYSCTRL_XOSC32K) Crystal Oscillator Enable Position */
#define SYSCTRL_XOSC32K_XTALEN_Msk            (_UINT16_(0x1) << SYSCTRL_XOSC32K_XTALEN_Pos)        /* (SYSCTRL_XOSC32K) Crystal Oscillator Enable Mask */
#define SYSCTRL_XOSC32K_XTALEN(value)         (SYSCTRL_XOSC32K_XTALEN_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_XTALEN_Pos)) /* Assigment of value for XTALEN in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_EN32K_Pos             _UINT16_(3)                                          /* (SYSCTRL_XOSC32K) 32kHz Output Enable Position */
#define SYSCTRL_XOSC32K_EN32K_Msk             (_UINT16_(0x1) << SYSCTRL_XOSC32K_EN32K_Pos)         /* (SYSCTRL_XOSC32K) 32kHz Output Enable Mask */
#define SYSCTRL_XOSC32K_EN32K(value)          (SYSCTRL_XOSC32K_EN32K_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_EN32K_Pos)) /* Assigment of value for EN32K in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_EN1K_Pos              _UINT16_(4)                                          /* (SYSCTRL_XOSC32K) 1kHz Output Enable Position */
#define SYSCTRL_XOSC32K_EN1K_Msk              (_UINT16_(0x1) << SYSCTRL_XOSC32K_EN1K_Pos)          /* (SYSCTRL_XOSC32K) 1kHz Output Enable Mask */
#define SYSCTRL_XOSC32K_EN1K(value)           (SYSCTRL_XOSC32K_EN1K_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_EN1K_Pos)) /* Assigment of value for EN1K in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_AAMPEN_Pos            _UINT16_(5)                                          /* (SYSCTRL_XOSC32K) Automatic Amplitude Control Enable Position */
#define SYSCTRL_XOSC32K_AAMPEN_Msk            (_UINT16_(0x1) << SYSCTRL_XOSC32K_AAMPEN_Pos)        /* (SYSCTRL_XOSC32K) Automatic Amplitude Control Enable Mask */
#define SYSCTRL_XOSC32K_AAMPEN(value)         (SYSCTRL_XOSC32K_AAMPEN_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_AAMPEN_Pos)) /* Assigment of value for AAMPEN in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_RUNSTDBY_Pos          _UINT16_(6)                                          /* (SYSCTRL_XOSC32K) Run in Standby Position */
#define SYSCTRL_XOSC32K_RUNSTDBY_Msk          (_UINT16_(0x1) << SYSCTRL_XOSC32K_RUNSTDBY_Pos)      /* (SYSCTRL_XOSC32K) Run in Standby Mask */
#define SYSCTRL_XOSC32K_RUNSTDBY(value)       (SYSCTRL_XOSC32K_RUNSTDBY_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_ONDEMAND_Pos          _UINT16_(7)                                          /* (SYSCTRL_XOSC32K) On Demand Control Position */
#define SYSCTRL_XOSC32K_ONDEMAND_Msk          (_UINT16_(0x1) << SYSCTRL_XOSC32K_ONDEMAND_Pos)      /* (SYSCTRL_XOSC32K) On Demand Control Mask */
#define SYSCTRL_XOSC32K_ONDEMAND(value)       (SYSCTRL_XOSC32K_ONDEMAND_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_STARTUP_Pos           _UINT16_(8)                                          /* (SYSCTRL_XOSC32K) Oscillator Start-Up Time Position */
#define SYSCTRL_XOSC32K_STARTUP_Msk           (_UINT16_(0x7) << SYSCTRL_XOSC32K_STARTUP_Pos)       /* (SYSCTRL_XOSC32K) Oscillator Start-Up Time Mask */
#define SYSCTRL_XOSC32K_STARTUP(value)        (SYSCTRL_XOSC32K_STARTUP_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_STARTUP_Pos)) /* Assigment of value for STARTUP in the SYSCTRL_XOSC32K register */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE1_Val  _UINT16_(0x0)                                        /* (SYSCTRL_XOSC32K) 0.122 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE32_Val _UINT16_(0x1)                                        /* (SYSCTRL_XOSC32K) 1.068 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE2048_Val _UINT16_(0x2)                                        /* (SYSCTRL_XOSC32K) 62.592 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE4096_Val _UINT16_(0x3)                                        /* (SYSCTRL_XOSC32K) 125.092 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE16384_Val _UINT16_(0x4)                                        /* (SYSCTRL_XOSC32K) 500.092 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE32768_Val _UINT16_(0x5)                                        /* (SYSCTRL_XOSC32K) 1000.092 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE65536_Val _UINT16_(0x6)                                        /* (SYSCTRL_XOSC32K) 2000.092 ms  */
#define   SYSCTRL_XOSC32K_STARTUP_CYCLE131072_Val _UINT16_(0x7)                                        /* (SYSCTRL_XOSC32K) 4000.092 ms  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE1        (SYSCTRL_XOSC32K_STARTUP_CYCLE1_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 0.122 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE32       (SYSCTRL_XOSC32K_STARTUP_CYCLE32_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 1.068 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE2048     (SYSCTRL_XOSC32K_STARTUP_CYCLE2048_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 62.592 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE4096     (SYSCTRL_XOSC32K_STARTUP_CYCLE4096_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 125.092 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE16384    (SYSCTRL_XOSC32K_STARTUP_CYCLE16384_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 500.092 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE32768    (SYSCTRL_XOSC32K_STARTUP_CYCLE32768_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 1000.092 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE65536    (SYSCTRL_XOSC32K_STARTUP_CYCLE65536_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 2000.092 ms Position  */
#define SYSCTRL_XOSC32K_STARTUP_CYCLE131072   (SYSCTRL_XOSC32K_STARTUP_CYCLE131072_Val << SYSCTRL_XOSC32K_STARTUP_Pos) /* (SYSCTRL_XOSC32K) 4000.092 ms Position  */
#define SYSCTRL_XOSC32K_WRTLOCK_Pos           _UINT16_(12)                                         /* (SYSCTRL_XOSC32K) Write Lock Position */
#define SYSCTRL_XOSC32K_WRTLOCK_Msk           (_UINT16_(0x1) << SYSCTRL_XOSC32K_WRTLOCK_Pos)       /* (SYSCTRL_XOSC32K) Write Lock Mask */
#define SYSCTRL_XOSC32K_WRTLOCK(value)        (SYSCTRL_XOSC32K_WRTLOCK_Msk & (_UINT16_(value) << SYSCTRL_XOSC32K_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the SYSCTRL_XOSC32K register */
#define SYSCTRL_XOSC32K_Msk                   _UINT16_(0x17FE)                                     /* (SYSCTRL_XOSC32K) Register Mask  */


/* -------- SYSCTRL_OSC32K : (SYSCTRL Offset: 0x18) (R/W 32) 32kHz Internal Oscillator (OSC32K) Control -------- */
#define SYSCTRL_OSC32K_RESETVALUE             _UINT32_(0x3F0080)                                   /*  (SYSCTRL_OSC32K) 32kHz Internal Oscillator (OSC32K) Control  Reset Value */

#define SYSCTRL_OSC32K_ENABLE_Pos             _UINT32_(1)                                          /* (SYSCTRL_OSC32K) Oscillator Enable Position */
#define SYSCTRL_OSC32K_ENABLE_Msk             (_UINT32_(0x1) << SYSCTRL_OSC32K_ENABLE_Pos)         /* (SYSCTRL_OSC32K) Oscillator Enable Mask */
#define SYSCTRL_OSC32K_ENABLE(value)          (SYSCTRL_OSC32K_ENABLE_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_EN32K_Pos              _UINT32_(2)                                          /* (SYSCTRL_OSC32K) 32kHz Output Enable Position */
#define SYSCTRL_OSC32K_EN32K_Msk              (_UINT32_(0x1) << SYSCTRL_OSC32K_EN32K_Pos)          /* (SYSCTRL_OSC32K) 32kHz Output Enable Mask */
#define SYSCTRL_OSC32K_EN32K(value)           (SYSCTRL_OSC32K_EN32K_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_EN32K_Pos)) /* Assigment of value for EN32K in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_EN1K_Pos               _UINT32_(3)                                          /* (SYSCTRL_OSC32K) 1kHz Output Enable Position */
#define SYSCTRL_OSC32K_EN1K_Msk               (_UINT32_(0x1) << SYSCTRL_OSC32K_EN1K_Pos)           /* (SYSCTRL_OSC32K) 1kHz Output Enable Mask */
#define SYSCTRL_OSC32K_EN1K(value)            (SYSCTRL_OSC32K_EN1K_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_EN1K_Pos)) /* Assigment of value for EN1K in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_RUNSTDBY_Pos           _UINT32_(6)                                          /* (SYSCTRL_OSC32K) Run in Standby Position */
#define SYSCTRL_OSC32K_RUNSTDBY_Msk           (_UINT32_(0x1) << SYSCTRL_OSC32K_RUNSTDBY_Pos)       /* (SYSCTRL_OSC32K) Run in Standby Mask */
#define SYSCTRL_OSC32K_RUNSTDBY(value)        (SYSCTRL_OSC32K_RUNSTDBY_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_ONDEMAND_Pos           _UINT32_(7)                                          /* (SYSCTRL_OSC32K) On Demand Control Position */
#define SYSCTRL_OSC32K_ONDEMAND_Msk           (_UINT32_(0x1) << SYSCTRL_OSC32K_ONDEMAND_Pos)       /* (SYSCTRL_OSC32K) On Demand Control Mask */
#define SYSCTRL_OSC32K_ONDEMAND(value)        (SYSCTRL_OSC32K_ONDEMAND_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_STARTUP_Pos            _UINT32_(8)                                          /* (SYSCTRL_OSC32K) Oscillator Start-Up Time Position */
#define SYSCTRL_OSC32K_STARTUP_Msk            (_UINT32_(0x7) << SYSCTRL_OSC32K_STARTUP_Pos)        /* (SYSCTRL_OSC32K) Oscillator Start-Up Time Mask */
#define SYSCTRL_OSC32K_STARTUP(value)         (SYSCTRL_OSC32K_STARTUP_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_STARTUP_Pos)) /* Assigment of value for STARTUP in the SYSCTRL_OSC32K register */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE3_Val   _UINT32_(0x0)                                        /* (SYSCTRL_OSC32K) 0.092 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE4_Val   _UINT32_(0x1)                                        /* (SYSCTRL_OSC32K) 0.122 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE6_Val   _UINT32_(0x2)                                        /* (SYSCTRL_OSC32K) 0.183 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE10_Val  _UINT32_(0x3)                                        /* (SYSCTRL_OSC32K) 0.305 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE18_Val  _UINT32_(0x4)                                        /* (SYSCTRL_OSC32K) 0.549 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE34_Val  _UINT32_(0x5)                                        /* (SYSCTRL_OSC32K) 1.038 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE66_Val  _UINT32_(0x6)                                        /* (SYSCTRL_OSC32K) 2.014 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE130_Val _UINT32_(0x7)                                        /* (SYSCTRL_OSC32K) 3.967 ms  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE3         (SYSCTRL_OSC32K_STARTUP_CYCLE3_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.092 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE4         (SYSCTRL_OSC32K_STARTUP_CYCLE4_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.122 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE6         (SYSCTRL_OSC32K_STARTUP_CYCLE6_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.183 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE10        (SYSCTRL_OSC32K_STARTUP_CYCLE10_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.305 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE18        (SYSCTRL_OSC32K_STARTUP_CYCLE18_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.549 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE34        (SYSCTRL_OSC32K_STARTUP_CYCLE34_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 1.038 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE66        (SYSCTRL_OSC32K_STARTUP_CYCLE66_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 2.014 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE130       (SYSCTRL_OSC32K_STARTUP_CYCLE130_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 3.967 ms Position  */
#define SYSCTRL_OSC32K_WRTLOCK_Pos            _UINT32_(12)                                         /* (SYSCTRL_OSC32K) Write Lock Position */
#define SYSCTRL_OSC32K_WRTLOCK_Msk            (_UINT32_(0x1) << SYSCTRL_OSC32K_WRTLOCK_Pos)        /* (SYSCTRL_OSC32K) Write Lock Mask */
#define SYSCTRL_OSC32K_WRTLOCK(value)         (SYSCTRL_OSC32K_WRTLOCK_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_CALIB_Pos              _UINT32_(16)                                         /* (SYSCTRL_OSC32K) Oscillator Calibration Position */
#define SYSCTRL_OSC32K_CALIB_Msk              (_UINT32_(0x7F) << SYSCTRL_OSC32K_CALIB_Pos)         /* (SYSCTRL_OSC32K) Oscillator Calibration Mask */
#define SYSCTRL_OSC32K_CALIB(value)           (SYSCTRL_OSC32K_CALIB_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_Msk                    _UINT32_(0x007F17CE)                                 /* (SYSCTRL_OSC32K) Register Mask  */


/* -------- SYSCTRL_OSCULP32K : (SYSCTRL Offset: 0x1C) (R/W 8) 32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control -------- */
#define SYSCTRL_OSCULP32K_RESETVALUE          _UINT8_(0x1F)                                        /*  (SYSCTRL_OSCULP32K) 32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control  Reset Value */

#define SYSCTRL_OSCULP32K_CALIB_Pos           _UINT8_(0)                                           /* (SYSCTRL_OSCULP32K) Oscillator Calibration Position */
#define SYSCTRL_OSCULP32K_CALIB_Msk           (_UINT8_(0x1F) << SYSCTRL_OSCULP32K_CALIB_Pos)       /* (SYSCTRL_OSCULP32K) Oscillator Calibration Mask */
#define SYSCTRL_OSCULP32K_CALIB(value)        (SYSCTRL_OSCULP32K_CALIB_Msk & (_UINT8_(value) << SYSCTRL_OSCULP32K_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSCULP32K register */
#define SYSCTRL_OSCULP32K_WRTLOCK_Pos         _UINT8_(7)                                           /* (SYSCTRL_OSCULP32K) Write Lock Position */
#define SYSCTRL_OSCULP32K_WRTLOCK_Msk         (_UINT8_(0x1) << SYSCTRL_OSCULP32K_WRTLOCK_Pos)      /* (SYSCTRL_OSCULP32K) Write Lock Mask */
#define SYSCTRL_OSCULP32K_WRTLOCK(value)      (SYSCTRL_OSCULP32K_WRTLOCK_Msk & (_UINT8_(value) << SYSCTRL_OSCULP32K_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the SYSCTRL_OSCULP32K register */
#define SYSCTRL_OSCULP32K_Msk                 _UINT8_(0x9F)                                        /* (SYSCTRL_OSCULP32K) Register Mask  */


/* -------- SYSCTRL_OSC8M : (SYSCTRL Offset: 0x20) (R/W 32) 8MHz Internal Oscillator (OSC8M) Control -------- */
#define SYSCTRL_OSC8M_RESETVALUE              _UINT32_(0x87070382)                                 /*  (SYSCTRL_OSC8M) 8MHz Internal Oscillator (OSC8M) Control  Reset Value */

#define SYSCTRL_OSC8M_ENABLE_Pos              _UINT32_(1)                                          /* (SYSCTRL_OSC8M) Oscillator Enable Position */
#define SYSCTRL_OSC8M_ENABLE_Msk              (_UINT32_(0x1) << SYSCTRL_OSC8M_ENABLE_Pos)          /* (SYSCTRL_OSC8M) Oscillator Enable Mask */
#define SYSCTRL_OSC8M_ENABLE(value)           (SYSCTRL_OSC8M_ENABLE_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_RUNSTDBY_Pos            _UINT32_(6)                                          /* (SYSCTRL_OSC8M) Run in Standby Position */
#define SYSCTRL_OSC8M_RUNSTDBY_Msk            (_UINT32_(0x1) << SYSCTRL_OSC8M_RUNSTDBY_Pos)        /* (SYSCTRL_OSC8M) Run in Standby Mask */
#define SYSCTRL_OSC8M_RUNSTDBY(value)         (SYSCTRL_OSC8M_RUNSTDBY_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_ONDEMAND_Pos            _UINT32_(7)                                          /* (SYSCTRL_OSC8M) On Demand Control Position */
#define SYSCTRL_OSC8M_ONDEMAND_Msk            (_UINT32_(0x1) << SYSCTRL_OSC8M_ONDEMAND_Pos)        /* (SYSCTRL_OSC8M) On Demand Control Mask */
#define SYSCTRL_OSC8M_ONDEMAND(value)         (SYSCTRL_OSC8M_ONDEMAND_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_PRESC_Pos               _UINT32_(8)                                          /* (SYSCTRL_OSC8M) Oscillator Prescaler Position */
#define SYSCTRL_OSC8M_PRESC_Msk               (_UINT32_(0x3) << SYSCTRL_OSC8M_PRESC_Pos)           /* (SYSCTRL_OSC8M) Oscillator Prescaler Mask */
#define SYSCTRL_OSC8M_PRESC(value)            (SYSCTRL_OSC8M_PRESC_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_PRESC_Pos)) /* Assigment of value for PRESC in the SYSCTRL_OSC8M register */
#define   SYSCTRL_OSC8M_PRESC_0_Val           _UINT32_(0x0)                                        /* (SYSCTRL_OSC8M) 1  */
#define   SYSCTRL_OSC8M_PRESC_1_Val           _UINT32_(0x1)                                        /* (SYSCTRL_OSC8M) 2  */
#define   SYSCTRL_OSC8M_PRESC_2_Val           _UINT32_(0x2)                                        /* (SYSCTRL_OSC8M) 4  */
#define   SYSCTRL_OSC8M_PRESC_3_Val           _UINT32_(0x3)                                        /* (SYSCTRL_OSC8M) 8  */
#define SYSCTRL_OSC8M_PRESC_0                 (SYSCTRL_OSC8M_PRESC_0_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 1 Position  */
#define SYSCTRL_OSC8M_PRESC_1                 (SYSCTRL_OSC8M_PRESC_1_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 2 Position  */
#define SYSCTRL_OSC8M_PRESC_2                 (SYSCTRL_OSC8M_PRESC_2_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 4 Position  */
#define SYSCTRL_OSC8M_PRESC_3                 (SYSCTRL_OSC8M_PRESC_3_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 8 Position  */
#define SYSCTRL_OSC8M_CALIB_Pos               _UINT32_(16)                                         /* (SYSCTRL_OSC8M) Oscillator Calibration Position */
#define SYSCTRL_OSC8M_CALIB_Msk               (_UINT32_(0xFFF) << SYSCTRL_OSC8M_CALIB_Pos)         /* (SYSCTRL_OSC8M) Oscillator Calibration Mask */
#define SYSCTRL_OSC8M_CALIB(value)            (SYSCTRL_OSC8M_CALIB_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_FRANGE_Pos              _UINT32_(30)                                         /* (SYSCTRL_OSC8M) Oscillator Frequency Range Position */
#define SYSCTRL_OSC8M_FRANGE_Msk              (_UINT32_(0x3) << SYSCTRL_OSC8M_FRANGE_Pos)          /* (SYSCTRL_OSC8M) Oscillator Frequency Range Mask */
#define SYSCTRL_OSC8M_FRANGE(value)           (SYSCTRL_OSC8M_FRANGE_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_FRANGE_Pos)) /* Assigment of value for FRANGE in the SYSCTRL_OSC8M register */
#define   SYSCTRL_OSC8M_FRANGE_0_Val          _UINT32_(0x0)                                        /* (SYSCTRL_OSC8M) 4 to 6MHz  */
#define   SYSCTRL_OSC8M_FRANGE_1_Val          _UINT32_(0x1)                                        /* (SYSCTRL_OSC8M) 6 to 8MHz  */
#define   SYSCTRL_OSC8M_FRANGE_2_Val          _UINT32_(0x2)                                        /* (SYSCTRL_OSC8M) 8 to 11MHz  */
#define   SYSCTRL_OSC8M_FRANGE_3_Val          _UINT32_(0x3)                                        /* (SYSCTRL_OSC8M) 11 to 15MHz  */
#define SYSCTRL_OSC8M_FRANGE_0                (SYSCTRL_OSC8M_FRANGE_0_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 4 to 6MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_1                (SYSCTRL_OSC8M_FRANGE_1_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 6 to 8MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_2                (SYSCTRL_OSC8M_FRANGE_2_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 8 to 11MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_3                (SYSCTRL_OSC8M_FRANGE_3_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 11 to 15MHz Position  */
#define SYSCTRL_OSC8M_Msk                     _UINT32_(0xCFFF03C2)                                 /* (SYSCTRL_OSC8M) Register Mask  */


/* -------- SYSCTRL_DFLLCTRL : (SYSCTRL Offset: 0x24) (R/W 16) DFLL48M Control -------- */
#define SYSCTRL_DFLLCTRL_RESETVALUE           _UINT16_(0x80)                                       /*  (SYSCTRL_DFLLCTRL) DFLL48M Control  Reset Value */

